# WallTaperedWidthAtTop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTaperedWidthAtTop Property
ParameterTypeId Class See Also
---
"Top Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTaperedWidthAtTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTaperedWidthAtTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTaperedWidthAtTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace